(ns enrating.data.2025.gornaz
  (:require [clojure.string :as str]
            [cheshire.core :as json]))

(defn- try-parse-int
  [s]
  (when s
    (try
      (Integer/parseInt s)
      (catch Exception e
        nil))))

(defn parse-data [d]
  (for [[number plate-number fio moto start finish total penalty total2] (map #(str/split % #"\t") (str/split d #"\n"))]
    (let [position (try-parse-int number)
          dnf? (or (= "00:00:00" total2)
                   (nil? position))
          penalty (str/trim (second (str/split penalty #"\|")))
          timebar? (= number "Тайм-бар")
          [surname name patronymic] (str/split fio #"\s")
          rider (try (enrating.data.riders/find-rider name surname patronymic nil)
                     (catch Exception e
                       nil))]
      (when-not rider
        (prn {:name name :surname surname :patronymic patronymic :rider-id (enrating.data.ids/rider-id)}))

      (prn
        (vec
          (concat
            `[:type :result :event-id event-id :classification-id classification-id
              :position ~position :plate-number ~(str/trim plate-number) :rider-id (find-rider-id ~name ~surname)]
            [:start start :finish finish :total total2 :penalty penalty]
            (when timebar?
              [:timebar? timebar?])
            (when dnf?
              [:dnf? dnf?])))))
    ))

(def gold
"1	11	Рогожкин Дмитрий	Ktm exc 300	09:00:00	13:13:44	 13:13:44	0 | 0	04:13:44
2	20	Цицимушкин Евгений	Husqvarna	09:00:30	13:33:34	13:33:34	0 | 0	04:33:04
3	21	Кокорин Николай	Ктм	09:00:00	13:40:14	13:40:14	0 | 0	04:40:14
4	23	Клеменков Виталий	KTM 300	09:02:30	14:01:57	14:01:57	0 | 0	04:59:27
5	3	Караксин Александр	© Husqvarna TE 300	09:00:30	14:03:52	14:03:52	0 | 0	05:03:22
6	18	Золотов Максим	Exc 300	09:02:30	14:19:48	14:19:48	0 | 0	05:17:18
7	14	Львов Максим	KTM EXC 300	09:00:30	14:18:56	14:18:56	0 | 0	05:18:26
8	6	Кириллов Кирилл	КлачКлач	09:03:00	14:24:30	14:24:30	0 | 0	05:21:30
9	15	Молчанов Дмитрий	gr8	09:01:00	14:39:47	14:39:47	0 | 0	05:38:47
10	5	Альматов Григорий	Husqvarna	09:03:00	14:50:32	14:50:32	0 | 0	05:47:32
11	9	Ушаков Михаил	Ктм	09:04:30	15:13:32	15:13:32	0 | 0	06:09:02
12	10	Казаков Алексей	Ktm exc300	09:04:00	14:45:30	14:45:30	0 | 30	06:11:30
13	17	Саитов Виталий	Husqvarna	09:02:00	15:15:34	15:15:34	0 | 0	06:13:34
14	7	Ярулин Вячеслав	Gr8	09:01:00	14:41:49	14:41:49	0 | 40	06:20:49
15	19	Юсупов Дамир	KTM	09:03:30	15:30:01	15:30:01	0 | 0	06:26:31
16	8	Швед Николай	GasGas	09:04:30	15:46:03	15:46:03	0 | 0	06:41:33
17	2	Рогожников Андрей	300 2т	09:01:00	15:50:32	15:50:32	0 | 0	06:49:32
18	4	Дунин Игорь	KTM	09:03:30	16:03:29	16:03:29	0 | 0	06:59:59
19	1	Федотов Владимир	Beta XT 300	09:04:00	17:46:59	17:46:59	0 | 0	08:42:59
20	12	Фёдоров Александр	Ктм	09:05:00	00:00:00		0 | 0	00:00:00
21	13	Рахимов Роберт	Ktm exc 300	09:05:00	00:00:00		0 | 0	00:00:00
22	16	Черевко Вадим	GR8	09:02:00	00:00:00		0 | 0	00:00:00")

(def silver
"1	51	Хатмуллин Артур	KTM	09:07:00	12:29:40	12:29:40	0 | 0	03:22:40
2	82	Лабутин Александр	Beta	09:06:30	12:34:41	12:34:41	0 | 0	03:28:11
3	68	Захаров Матвей	Beta 300 rr	09:07:00	12:50:32	12:50:32	0 | 0	03:43:32
4	57	Шилов Денис	KTM 300 EXC	09:08:30	12:52:51	12:52:51	0 | 0	03:44:21
5	52	Журавский Евгений	Хускварник	09:09:30	12:57:29	12:57:29	0 | 0	03:47:59
6	87	Макаров Вячеслав	300 2t	09:17:30	13:07:25	13:07:25	0 | 0	03:49:55
7	91	Боярских Евгений	Te300	09:08:00	13:02:27	13:02:27	0 | 0	03:54:27
8	127	Свяжин Артем	GR8	09:18:30	13:15:11	13:15:11	0 | 0	03:56:41
9	55	Полежаев Илья	Хенджан 300 2т	09:10:00	13:11:12	13:11:12	0 | 0	04:01:12
10	89	Удачин Александр	KTM	09:07:30	13:10:35	13:10:35	0 | 0	04:03:05
11	113	Килунин Владимир	KTM	09:13:30	13:28:36	13:28:36	0 | 0	04:15:06
12	90	Миронов Александр	КТМ	09:15:00	13:33:10	13:33:10	0 | 0	04:18:10
13	94	Голов Виталий	Husqvarna TE300	09:08:30	13:27:03	13:27:03	0 | 0	04:18:33
14	110	Путов Евгений	Ktm	09:16:00	13:35:31	13:35:31	0 | 0	04:19:31
15	105	Кузнецов Роман	Huska	09:09:00	13:28:33	13:28:33	0 | 0	04:19:33
16	61	Аверин Дмитрий	KTM 300	09:13:00	13:33:01	13:33:01	0 | 0	04:20:01
17	99	Земцов Денис	Ктм	09:14:30	13:35:09	13:35:09	0 | 0	04:20:39
18	79	Кокорин Алексей	KTM EXC300	09:14:30	13:37:28	13:37:28	0 | 0	04:22:58
19	76	Кузнецов Илья	Ktm 300	09:11:00	13:35:28	13:35:28	0 | 0	04:24:28
20	131	Копытов Артем	Прогаси четыристаписятка	09:14:00	13:38:58	13:38:58	0 | 0	04:24:58
21	134	Филатов Степан	Stark Varg	09:07:30	13:33:29	13:33:29	0 | 0	04:25:59
22	80	Калинин Артем		09:24:30	13:11:05	13:11:05	0 | 40	04:26:35
23	62	Бороздин Юрий	Husqvarna TE300	09:13:30	13:40:36	13:40:36	0 | 0	04:27:06
24	54	Колобов Дмитрий	KTM tbi	09:16:30	13:43:41	13:43:41	0 | 0	04:27:11
25	122	Швецов Антон	Beta 300	09:12:00	13:40:57	13:40:57	0 | 0	04:28:57
26	75	Толкачев Антон	КТМ	09:09:30	13:39:07	13:39:07	0 | 0	04:29:37
27	81	Хабибрахманов Султан	Ktm exc300	09:12:00	13:41:51	13:41:51	0 | 0	04:29:51
28	128	Максимов Тимофей	Hengjian 302T	09:14:00	13:48:30	13:48:30	0 | 0	04:34:30
29	125	Попцов Александр	КТМ	09:12:30	13:47:59	13:47:59	0 | 0	04:35:29
30	58	Семилетов Алексей	KTM	09:09:00	13:54:24	13:54:24	0 | 0	04:45:24
31	69	Данилов Евгений	Husqvarna	09:20:30	14:06:11	14:06:11	0 | 0	04:45:41
32	53	Вебер Александр	КТМ 200	09:15:30	14:02:46	14:02:46	0 | 0	04:47:16
33	133	Симачёв Александр	Ланза	09:20:30	14:07:51	14:07:51	0 | 0	04:47:21
34	124	Швейкерт Иван	Exc300	09:20:00	14:10:44	14:10:44	0 | 0	04:50:44
35	103	Кетов Константин	КТМ	09:24:00	14:20:43	14:20:43	0 | 0	04:56:43
36	96	Склюев Андрей	gasgas300	09:15:00	14:12:23	14:12:23	0 | 0	04:57:23
37	88	Плаксин Александр	KTM 300 EXC	09:12:30	14:10:51	14:10:51	0 | 0	04:58:21
38	108	Бодрин Владимир	Husqvarna te300	09:10:30	14:13:01	14:13:01	0 | 0	05:02:31
39	93	Филиппов Иван	KTM EXC 300	09:16:00	14:20:48	14:20:48	0 | 0	05:04:48
40	95	Садовой Илья	KTM EXC 300	09:10:30	14:15:20	14:15:20	0 | 0	05:04:50
41	63	Кондратьев Сергей	Gr8	09:11:00	14:16:53	14:16:53	0 | 0	05:05:53
42	92	Сарваров Ильфар	ГАЗель	09:10:00	14:18:24	14:18:24	0 | 0	05:08:24
43	116	Мельников Александр	КТМ	09:19:30	14:28:23	14:28:23	0 | 0	05:08:53
44	109	Ситников Игорь	КТМ	09:13:00	14:28:55	14:28:55	0 | 0	05:15:55
45	97	Белькевич Евгений	Beta xtrainer 300	09:17:00	14:47:30	14:47:30	0 | 0	05:30:30
46	83	Отинов Александр	KTM 450 exc-f SIX DAYS	09:17:00	14:47:34	14:47:34	0 | 0	05:30:34
47	98	Киселёв Евгений	Hengjian	09:18:00	14:53:04	14:53:04	0 | 0	05:35:04
48	56	Душин Артём	Rem	09:11:30	14:47:36	14:47:36	0 | 0	05:36:06
49	100	Клевцов Максим	Husqvarna	09:16:30	14:53:04	14:53:04	0 | 0	05:36:34
50	59	Степанов Матвей	Камакс	09:18:00	14:55:58	14:55:58	0 | 20	05:57:58
51	121	Харитонов Анатолий	КТМ 2т300	09:19:00	15:21:15	15:21:15	0 | 0	06:02:15
52	129	Кузнецов Максим	GR8 2T	09:20:00	15:25:55	15:25:55	0 | 0	06:05:55
53	115	Леонтьев Леонид	KTM EXC 300	09:17:30	15:25:00	15:25:00	0 | 0	06:07:30
54	114	Демаков Сергей	Хеджан триста два тэ	09:21:30	15:30:37	15:30:37	0 | 0	06:09:07
55	126	Петров Алексей	Exc300	09:22:00	15:34:56	15:34:56	0 | 0	06:12:56
56	64	Бадьин Андрей	КТМ	09:11:30	13:29:03	13:29:03	0 | 120	06:17:33
57	70	Моторин Максим	Bse	09:23:00	15:51:48	15:51:48	0 | 0	06:28:48
58	73	Петров Александр	Gas Gas	09:22:30	15:53:00	15:53:00	0 | 0	06:30:30
59	72	Чибаков Владислав	Beta 300 x-pro	09:19:00	15:52:13	15:52:13	0 | 0	06:33:13
60	86	Мугулов Александр	Koshine 302t	09:15:30	15:51:52	15:51:52	0 | 0	06:36:22
61	112	Репин Сергей	Husqvarna 250 tbi	09:25:00	16:06:34	16:06:34	0 | 0	06:41:34
62	74	Кокшаров Ален	Газгаз 250	09:19:30	15:12:40	15:12:40	0 | 120	07:53:10
63	107	Абрамов Иван	Ktm 300 tbi	09:22:30	13:04:40	13:04:40	0 | 0	03:42:10
64	130	Беспятых Евгений	Husqvarna 300 2t	09:18:30	14:38:32	14:38:32	0 | 0	05:20:02
65	119	Азегов Андрей	Ктм	09:21:00	15:42:24	15:42:24	0 | 0	06:21:24
66	132	Максимовских Артем	Husqvarna	09:22:00	16:01:04	16:01:04	0 | 0	06:39:04
67	66	Волегов Дмитрий	Zuuuum	09:23:00	00:00:00		0 | 0	00:00:00
68	67	Мерзляков Александр	Beta	09:23:30	00:00:00		0 | 0	00:00:00
69	77	Юшков Виктор	GAS GAS ЕС300	09:08:00	00:00:00		0 | 0	00:00:00
70	78	Калинин Егор	KTM	09:24:30	00:00:00		0 | 0	00:00:00
71	84	Савонин Александр	Хуска 300 2т	09:23:30	00:00:00		0 | 0	00:00:00
72	106	Вискунов Юлий	KTM 300	09:24:00	00:00:00		0 | 0	00:00:00
73	111	Иванов Павел	ТЕ 300	09:25:00	00:00:00		0 | 0	00:00:00
74	117	Гладких Максим	Gr8	09:25:30	00:00:00		0 | 0	00:00:00
75	118	Макаров Максим	ТБИ	09:21:00	00:00:00		0 | 0	00:00:00
76	120	Галкин Олег	Bse t 8	09:21:30	00:00:00		0 | 0	00:00:00
77	123	Баранов Илья	Rieju m300	09:06:30	00:00:00		0 | 0	00:00:00")

(def bronze
"1	260	Киселев Сергей	KEWS k23	09:33:30	12:06:26	12:06:26	0 | 0	02:32:56
2	161	Мирзаметов Евгений	KTM E	09:31:00	12:05:27	12:05:27	0 | 0	02:34:27
3	152	Солодовник Игорь	КАМАКС	09:27:30	12:06:31	12:06:31	0 | 0	02:39:01
4	182	Варанкин Юрий	GR8	09:29:30	12:12:07	12:12:07	0 | 0	02:42:37
5	213	Карелин Антон	Камах	09:27:00	12:10:44	12:10:44	0 | 0	02:43:44
6	281	Шестаков Владимир	Beta 300 RR	09:27:00	12:11:23	12:11:23	0 | 0	02:44:23
7	191	Рахмеев Александр	KTM	09:34:30	12:19:09	12:19:09	0 | 0	02:44:39
8	257	Грачев Виталий	BRZ	09:29:30	12:15:11	12:15:11	0 | 0	02:45:41
9	177	Отинов Семен	KTM 300	09:35:30	12:24:24	12:24:24	0 | 0	02:48:54
10	163	Овчинников Никита	Jhl	09:27:30	12:16:29	12:16:29	0 | 0	02:48:59
11	265	Киселёв Владимир	КTM	09:36:30	12:27:16	12:27:16	0 | 0	02:50:46
12	275	Тясин Михаил	Henjian 300	09:31:00	12:25:07	12:25:07	0 | 0	02:54:07
13	251	Сухоносов Евгений	KTM 2T 300	09:43:00	12:37:57	12:37:57	0 | 0	02:54:57
14	284	Решетков Василий	Хускварна те300	09:33:30	12:28:36	12:28:36	0 | 0	02:55:06
15	190	Козлов Денис	Husqvarna te300	09:29:00	12:24:22	12:24:22	0 | 0	02:55:22
16	285	Тимошевский Дмитрий	GR 8 300 2t	09:28:30	12:28:35	12:28:35	0 | 0	03:00:05
17	210	Кварацхелия Данил	Husqvarna	09:32:30	12:34:09	12:34:09	0 | 0	03:01:39
18	200	Завьялов Никита	Motolend x3 lux	09:40:00	12:41:50	12:41:50	0 | 0	03:01:50
19	230	Ярославцев Евгений	Gr	09:32:00	12:34:06	12:34:06	0 | 0	03:02:06
20	271	Перевозчиков Александр	КТМ 300	09:30:30	12:33:00	12:33:00	0 | 0	03:02:30
21	185	Асташов Леонид	Avantis 250	09:37:00	12:39:34	12:39:34	0 | 0	03:02:34
22	164	Шаравьёв Егор	BETA	09:37:30	12:40:16	12:40:16	0 | 0	03:02:46
23	192	Коробейников Антон	GR8 300 2t	09:32:30	12:35:46	12:35:46	0 | 0	03:03:16
24	231	Тясин Владимир	Ктм	09:34:00	12:37:30	12:37:30	0 | 0	03:03:30
25	155	Кокшаров Максим	Хускварна	09:30:00	12:34:41	12:34:41	0 | 0	03:04:41
26	272	Баландин Аркадий	Husqvarna te300	09:28:00	12:34:42	12:34:42	0 | 0	03:06:42
27	283	Тараненко Артем	Ktm	09:35:30	12:42:48	12:42:48	0 | 0	03:07:18
28	301	Аленьковский Дмитрий	Sherco	09:37:00	12:47:09	12:47:09	0 | 0	03:10:09
29	234	Попов Валерий	Beta	09:41:30	12:54:05	12:54:05	0 | 0	03:12:35
30	184	Титов Антон	Husqvarna fe350	09:43:00	12:55:44	12:55:44	0 | 0	03:12:44
31	238	Захаров Алексей	Lanza top	09:33:00	12:46:17	12:46:17	0 | 0	03:13:17
32	299	Чистополов Денис	Хускварна те300	09:43:30	12:59:06	12:59:06	0 | 0	03:15:36
33	193	Миков Денис	GR8	09:34:00	12:49:39	12:49:39	0 | 0	03:15:39
34	176	Ведерников Иван	Kews	09:40:30	12:56:12	12:56:12	0 | 0	03:15:42
35	291	Афанасьев Роман	Авантис 300 про	09:39:00	12:55:47	12:55:47	0 | 0	03:16:47
36	295	Колягин Иван	Husqvarna	09:46:30	13:03:45	13:03:45	0 | 0	03:17:15
37	290	Суслопаров Максим	2T	09:31:30	12:51:04	12:51:04	0 | 0	03:19:34
38	286	Зырянов Антон	Husqvarna	09:46:30	13:07:24	13:07:24	0 | 0	03:20:54
39	248	Баштовой Евгений	КТМ	09:28:00	12:51:09	12:51:09	0 | 0	03:23:09
40	214	Сарваритдинов Амир	Sherco 300	09:45:30	13:10:02	13:10:02	0 | 0	03:24:32
41	278	Саначёв Даниил	Кекс	09:38:30	13:03:35	13:03:35	0 | 0	03:25:05
42	198	Ложкин Алексей	GR8	09:50:00	13:15:09	13:15:09	0 | 0	03:25:09
43	181	Мальцев Дмитрий	Авантис	09:30:30	12:55:40	12:55:40	0 | 0	03:25:10
44	282	Захаров Михаил	Ктм	09:29:00	12:55:40	12:55:40	0 | 0	03:26:40
45	256	Мальчиков Андрей	Husqvarna te 300	09:49:30	13:16:57	13:16:57	0 | 0	03:27:27
46	208	Табанин Константин	Husqvarna	09:42:00	13:09:43	13:09:43	0 | 0	03:27:43
47	288	Носков Владимир	KTM 2T 300	09:33:00	13:01:52	13:01:52	0 | 0	03:28:52
48	298	Васильев Константин	gr8	09:38:30	13:07:40	13:07:40	0 | 0	03:29:10
49	166	Кислухин Артём	Hengjian 300 2t	09:38:00	13:11:22	13:11:22	0 | 0	03:33:22
50	211	Додонов Владимир	Kews k16	09:34:30	13:21:23	13:21:23	0 | 0	03:46:53
51	302	Кабаненко Максим	KTM	09:40:00	13:28:30	13:28:30	0 | 0	03:48:30
52	264	Одинцов Даниил	HENGJIAN Z300	09:43:30	13:33:55	13:33:55	0 | 0	03:50:25
53	173	Николаев Иван	Brz x6m	09:36:30	13:27:06	13:27:06	0 | 0	03:50:36
54	195	Ишонин Александр	KEWS K23L	09:49:30	13:40:47	13:40:47	0 | 0	03:51:17
55	205	Задровский Владимир	Te300	09:39:30	13:34:00	13:34:00	0 | 0	03:54:30
56	280	Коротаев Алексей	Husqvarna TE300	09:42:30	13:37:31	13:37:31	0 | 0	03:55:01
57	178	Чедаев Иван	Heritage	09:53:30	13:50:06	13:50:06	0 | 0	03:56:36
58	197	Завьялов Сергей	Кевс к-16	09:35:00	13:38:40	13:38:40	0 | 0	04:03:40
59	228	Хунцелиа Денис	Kews k23	09:35:00	13:38:40	13:38:40	0 | 0	04:03:40
60	263	Тихонов Иван	Ktm exc250	09:44:00	13:51:08	13:51:08	0 | 0	04:07:08
61	250	Шилова Анна	Хаска 150	09:41:00	13:49:03	13:49:03	0 | 0	04:08:03
62	167	Лопатин Вадим	Hengjian Z30	09:51:00	14:01:29	14:01:29	0 | 0	04:10:29
63	189	Чудинов Александр	Hengjian 300	09:45:00	13:56:44	13:56:44	0 | 0	04:11:44
64	194	Лесников Данил	Kews 250 2t	09:41:30	13:55:29	13:55:29	0 | 0	04:13:59
65	233	Новиков Владимир	КЕВС nb300	09:47:30	14:02:38	14:02:38	0 | 0	04:15:08
66	215	Зиязов Ростислав	BSE	09:32:00	13:48:53	13:48:53	0 | 0	04:16:53
67	253	Хицов Юрий	GasGas	09:50:30	14:07:56	14:07:56	0 | 0	04:17:26
68	220	Коновалов Иван	BSE Z 11	09:39:30	13:57:09	13:57:09	0 | 0	04:17:39
69	269	Полыгалов Алексей	Хаска	09:58:30	14:16:22	14:16:22	0 | 0	04:17:52
70	199	Варанкин Сергей	Kayo T2 enduro	09:44:30	14:02:37	14:02:37	0 | 0	04:18:07
71	172	Анисимов Сергей	GR8	09:37:30	13:59:45	13:59:45	0 | 0	04:22:15
72	162	Исупов Евгений	BSE	09:49:00	14:12:21	14:12:21	0 | 0	04:23:21
73	247	Чурин Евгений	Газик	09:31:30	13:55:25	13:55:25	0 | 0	04:23:55
74	187	Шаров Андрей	Koshine	09:57:00	14:24:02	14:24:02	0 | 0	04:27:02
75	188	Адам Иван	GR8 300 2t	09:49:00	14:17:13	14:17:13	0 | 0	04:28:13
76	153	Лямин Константин	Мотик	09:39:00	14:08:13	14:08:13	0 | 0	04:29:13
77	156	Тимаев Артем	Hengjian	09:44:30	14:19:56	14:19:56	0 | 0	04:35:26
78	268	Злобин Алексей	GasGas 300ec	09:40:30	14:16:41	14:16:41	0 | 0	04:36:11
79	157	Жуланов Даниил	Beta	09:36:00	14:16:48	14:16:48	0 | 0	04:40:48
80	255	Сухарев Олег	Zm tracer	09:51:00	14:31:53	14:31:53	0 | 0	04:40:53
81	186	Денисов Юрий	Betta	09:48:00	14:29:30	14:29:30	0 | 0	04:41:30
82	171	Блинов Виктор	Hengjian S7 300	09:48:00	14:29:52	14:29:52	0 | 0	04:41:52
83	224	Трубников Кирилл	Trx	09:46:00	14:33:48	14:33:48	0 | 0	04:47:48
84	169	Прыкин Дмитрий	Beta 300rr	09:42:00	14:37:58	14:37:58	0 | 0	04:55:58
85	232	Рашитов Шамиль	KTM	09:28:30	14:28:08	14:28:08	0 | 0	04:59:38
86	226	Локаткин Илья	Ataki EF 300	09:47:30	14:49:56	14:49:56	0 | 0	05:02:26
87	158	Рязанов Александр	Kayo	09:51:30	14:56:54	14:56:54	0 | 0	05:05:24
88	266	Исупов Александр	Regulmoto	09:57:00	15:05:18	15:05:18	0 | 0	05:08:18
89	243	Хорошев Вячеслав	Rieju MR 300	09:51:30	15:04:17	15:04:17	0 | 0	05:12:47
90	202	Щин Сергей	Hengjian 300	09:57:00	15:25:58	15:25:58	0 | 0	05:28:58
91	207	Поленков Олег	КТМЭ	09:54:30	15:40:53	15:40:53	0 | 0	05:46:23
92	168	Рякин Андрей	Kews	09:56:00	15:44:48	15:44:48	0 | 0	05:48:48
93	203	Поздеев Артур	GR 8 300 2T	09:44:00	15:35:04	15:35:04	0 | 0	05:51:04
94	300	Маннапов Мунир	Husgvarna	09:59:00	15:57:40	15:57:40	0 | 0	05:58:40
95	259	Килин Максим	Beta	09:52:30	15:25:15	15:25:15	0 | 30	06:02:45
96	180	Сидоревич Матвей	Кевс к16	09:52:30	15:55:54	15:55:54	0 | 0	06:03:24
97	159	Юнеев Ренат	RM	09:55:30	16:16:47	16:16:47	0 | 0	06:21:17
98	293	Бурыкин Дмитрий	Gas gas EC300	09:52:00	16:27:17	16:27:17	0 | 0	06:35:17
99	154	Пересада Егор	KTM EXC 300 TBI	09:53:00	16:34:04	16:34:04	0 | 0	06:41:04
100	165	Даудрих Михаил	XGZ	09:57:30	16:48:20	16:48:20	0 | 60	07:50:50
101	209	Лесников Артём	300	09:57:00	16:46:58	16:46:58	0 | 0	06:49:58
102	160	Цыганков Яков	Kews k16 nb300	09:56:00	00:00:00		0 | 0	00:00:00
103	170	Кузнецов Александр	Minff	09:53:30	00:00:00		0 | 0	00:00:00
104	174	Осколков Александр	GG EC 300	09:59:00	00:00:00		0 | 0	00:00:00
105	175	Черанёв Константин	Гр8	09:30:00	00:00:00		0 | 0	00:00:00
106	179	Сосунов Николай	Регульмото	09:54:00	00:00:00		0 | 0	00:00:00
107	196	Соколов Максим	Хенджан	09:36:00	00:00:00		0 | 0	00:00:00
108	201	Ичетовкин Николай	Kayo T2	09:48:30	00:00:00		0 | 0	00:00:00
109	204	Митяшин Михаил	Велосипед с моторчиком	09:48:30	00:00:00		0 | 0	00:00:00
110	206	Корнилков Сергей	Zm BUSTER 300	09:50:00	00:00:00		0 | 0	00:00:00
111	212	Александровский Александр	Кевс к 16	09:54:00	00:00:00		0 | 0	00:00:00
112	221	Антипин Михаил	Кевс	09:57:00	00:00:00		0 | 0	00:00:00
113	223	Мохов Антон	Legend 300	09:50:30	00:00:00		0 | 0	00:00:00
114	225	Коновалов Павел	Hengjian z300	09:41:00	00:00:00		0 | 0	00:00:00
115	236	Глущенко Николай	YamahaWR250F#синийтрактор	09:55:30	00:00:00		0 | 0	00:00:00
116	239	Иванов Роман	Haskl	09:54:30	00:00:00		0 | 0	00:00:00
117	241	Холкин Дмитрий	KTM	09:46:00	00:00:00		0 | 0	00:00:00
118	242	Жуков Алексей	Kews К-16	09:57:30	00:00:00		0 | 0	00:00:00
119	244	Тиунов Егор	GR 8	09:58:00	00:00:00		0 | 0	00:00:00
120	245	Данилевский Роман	Gasgas EC250	09:55:00	00:00:00		0 | 0	00:00:00
121	252	Дубовой Александр	Хенджан	09:52:00	00:00:00		0 | 0	00:00:00
122	254	Попков Вячеслав	Gr8 (4T)	09:55:00	00:00:00		0 | 0	00:00:00
123	261	Поздеев Сергей	Koshine	09:45:00	00:00:00		0 | 0	00:00:00
124	262	Леонтьев Федот	BSE T5	09:45:30	00:00:00		0 | 0	00:00:00
125	267	Яхин Эдуард	Ктм	09:58:30	00:00:00		0 | 0	00:00:00
126	270	Бирюков Денис	Husqvarna 300	09:59:00	00:00:00		0 | 0	00:00:00
127	273	Коновалов Александр	Kews	09:47:00	00:00:00		0 | 0	00:00:00
128	274	Сибагатуллин Динар	GR 8	09:59:00	00:00:00		0 | 0	00:00:00
129	276	Попов Федор	Hengjian	09:53:00	00:00:00		0 | 0	00:00:00
130	277	Чежегов Андрей	Ктм	09:38:00	00:00:00		0 | 0	00:00:00
131	279	Зыков Леонид	Ержан	09:42:30	00:00:00		0 | 0	00:00:00
132	296	Антонов Антон	Камах 250mt	09:47:00	00:00:00		0 | 0	00:00:00
133	297	Галкин Артём	Ержан 302т	00:00:00	00:00:00		0 | 0	00:00:00")

