(ns enrating.data.2025.slg
  (:require [clojure.string :as str]
            [enrating.data.ids :refer [result-id classification-id rider-id]]))

;; Самая Легкая Гонка - вспомогательные функции для ручной обработки результатов
;; история анализа и занесения в базу

;; Helper functions

;; rawdata/2025/slg1/Класс №7.pdf

;; Где не было города - добавил прочерк
;; Города с пробелами типа Нижний Тагил сделал в Нижний-Тагил
;; Иначе тяжело обрабатывать
;;
(def raw-data7 "
Поляков Никита Челябинск 23 11:36:30 14:04:24 2:27:54 0:00:00 2:27:54 1
Цицимушкин Евгений Кыштым 10 11:33:00 14:04:23 2:31:23 0:00:00 2:31:23 2
Мишагин Андрей Челябинск 165 11:55:00 14:59:55 3:04:55 0:00:00 3:04:55 3
Лядецкий Павел Челябинск 22 11:36:00 14:45:34 3:09:34 0:00:00 3:09:34 4
Майбуров Константин - 943 11:38:00 15:05:18 3:27:18 0:00:00 3:27:18 5
Ишмаков Эрик Уфа 8 11:32:30 15:03:09 3:30:39 0:00:00 3:30:39 6
Кузнецов Роман Ижевск 6 11:32:00 15:03:24 3:31:24 0:00:00 3:31:24 7
Калинин Артём Магнитогорск 25 11:37:00 15:24:59 3:47:59 0:00:00 3:47:59 8
Шилов Денис Екатеринбург 19 11:35:30 15:29:02 3:53:32 0:00:00 3:53:32 9
Медведюк Денис Тюмень 13 11:34:00 15:30:43 3:56:43 0:00:00 3:56:43 10
Ушаков Михаил Тюмень 21 11:36:00 15:39:45 4:03:45 0:00:00 4:03:45 11
Юсупов Дамир - 905 11:37:30 15:05:15 3:27:45 0:40:00 4:07:45 12
Калмыков Константин Челябинск 24 11:36:30 15:50:23 4:13:53 0:00:00 4:13:53 13
Миронов Александр Сургут 1 11:31:00 16:10:24 4:39:24 0:00:00 4:39:24 14
Кошелев Алексей - 12 11:33:30 15:40:02 4:06:32 0:40:00 4:46:32 15
Цуркан Артём Екатеринбург 9 11:33:00 14:22:10 2:49:10 2:00:00 4:49:10 16
Саитов Виталий Пермь 11 11:33:30 15:06:19 3:32:49 1:20:00 4:52:49 17
Швед Николай - 910 11:37:30 15:23:08 3:45:38 1:20:00 5:05:38 18
Габбасов Олег Челябинск 3 11:31:30 16:40:59 5:09:29 0:00:00 5:09:29 19
Терентьев Сергей Магнитогорск 16 11:34:30 14:04:20 2:29:50 2:40:00 5:09:50 20
Ярулин Вячеслав Екатеринбург 14 11:34:00 14:15:42 2:41:42 2:40:00 5:21:42 21
Сарваров Ильфар Сургут 4 11:31:30 16:27:24 4:55:54 0:40:00 5:35:54 22
Иванов Артем Екатеринбург 7 11:32:30 14:13:48 2:41:18 3:20:00 6:01:18 23
Синченко Кирилл Москва 2 11:31:00 14:42:16 3:11:16 5:20:00 8:31:16 24
Полномочнов Андрей Лянтор 18 11:35:00 16:17:07 4:42:07 5:20:00 10:02:07 25
Забродин Ростислав Курган 5 11:32:00 18:05:18 6:33:18 5:20:00 11:53:18 26
")

;; rawdata/2025/slg1/Класс №6.pdf

(def raw-data6-page1
"Адрианов Петр Челябинск 124 11:44:30 14:25:58 2:41:28 0:00:00 2:41:28 1
Журавский Евгений Пермь 208 12:05:30 14:48:38 2:43:08 0:00:00 2:43:08 2
Романов Константин с.Еткуль 264 12:19:30 15:06:15 2:46:45 0:00:00 2:46:45 3
Хабибрахманов Султан Екатеринбург 123 11:44:30 14:32:01 2:47:31 0:00:00 2:47:31 4
Цыбулин Виктор Тюмень 142 11:49:00 14:40:13 2:51:13 0:00:00 2:51:13 5
Аверин Дмитрий Екатеринбург 147 11:50:30 14:52:27 3:01:57 0:00:00 3:01:57 6
Харитонов Антон Уфа 227 12:10:30 15:12:48 3:02:18 0:00:00 3:02:18 7
Бодрин Владимир Магнитогорск 200 12:03:30 15:09:18 3:05:48 0:00:00 3:05:48 8
Созинов Алексей - 916 13:13:00 16:23:10 3:10:10 0:00:00 3:10:10 9
Кокорин Алексей Курган 249 12:16:00 15:26:55 3:10:55 0:00:00 3:10:55 10
Галимов Азат Уфа 242 12:14:00 15:26:28 3:12:28 0:00:00 3:12:28 11
Выгодский Александр Верхняя-Пышма 241 12:14:00 15:28:39 3:14:39 0:00:00 3:14:39 12
Семилетов Алексей Курган 220 12:08:30 15:23:28 3:14:58 0:00:00 3:14:58 13
Федин Евгений Коркино 195 12:02:30 14:40:22 2:37:52 0:40:00 3:17:52 14
Хафизов Ринат - 927 13:13:00 16:31:34 3:18:34 0:00:00 3:18:34 15
Ощепков Виталий Пермь 115 11:42:30 15:02:48 3:20:18 0:00:00 3:20:18 16
Захаров Матвей Озёрск 256 12:17:30 15:00:03 2:42:33 0:40:00 3:22:33 17
Кузнецов Илья Екатеринбург 230 12:11:00 15:34:04 3:23:04 0:00:00 3:23:04 18
Ломакин Андрей Трехгорный 224 12:09:30 15:33:36 3:24:06 0:00:00 3:24:06 19
Кетов Константин Пермь 141 11:49:00 15:14:16 3:25:16 0:00:00 3:25:16 20
Боярских Евгений Екатеринбург 254 12:17:00 15:03:16 2:46:16 0:40:00 3:26:16 21
Кочетов Егор Уфа 103 11:39:30 14:27:31 2:48:01 0:40:00 3:28:01 22
Вербилович Иван Екатеринбург 167 11:55:30 15:24:34 3:29:04 0:00:00 3:29:04 23
Зараменских Денис Коркино 211 12:06:30 15:35:42 3:29:12 0:00:00 3:29:12 24
")

;; На первой странице все ок, на остальных - транспонировано, поэтому немного ивзращаемся
(def raw-data6-page2-t
"Ахманаев Некрасов Жилин Данилов Толкачев Козлов Калинин Чибаков Лугаськов Вязин Шигабеев Ахтямов Бороздин Склюев Филиппов Лепаев Азаров Зырянов Носков Свяжин Иванов Маркелов Галкин Фурсов Шаталин Попов Шафигулин Пашнин Сборошенко Белькевич Гуляев Дмитрий Александр Михаил Евгений Антон Денис Виктор Влад Вадим Владимир Евгений Вадим Юрий Андрей Иван Алексей Кирилл Антон Владимир Артем Дмитрий Константин Кирилл Михаил Андрей Виктор Андрей Владислав Федор Евгений Алексей Екатеринбург Копейск Курган Пермь Талица Челябинск Магнитогорск - Ревда Курган Заречный Миасс Екатеринбург Тюмень Екатеринбург Уфа Челябинск Магнитогорск Магнитогорск - Каменск-Уральский Челябинск - Челябинск Челябинск Курган Челябинск Миасское Челябинск Челябинск - 140 154 203 252 131 129 128 934 251 207 120 219 169 184 246 236 174 118 215 920 105 237 911 218 136 130 178 135 234 121 915 11:48:30 11:52:00 12:04:30 12:16:30 11:46:30 11:46:00 11:45:30 13:13:00 12:16:30 12:05:30 11:43:30 12:08:30 11:56:00 11:59:30 12:15:00 12:12:30 11:57:00 11:43:00 12:07:30 13:12:30 11:40:00 12:13:00 13:11:00 12:08:00 11:47:30 11:46:00 11:58:00 11:47:30 12:12:00 11:44:00 13:12:00 15:18:45 15:23:25 15:36:33 15:48:50 15:20:28 15:22:25 15:24:03 16:52:00 15:19:43 15:49:57 15:29:04 15:54:16 15:45:15 15:49:13 16:04:50 15:23:08 15:51:39 15:00:04 16:12:05 15:58:08 15:08:46 15:42:11 16:03:59 16:21:46 15:22:12 15:23:01 16:15:17 15:25:55 16:30:38 16:03:20 16:51:22 3:30:15 3:31:25 3:32:03 3:32:20 3:33:58 3:36:25 3:38:33 3:39:00 3:03:13 3:44:27 3:45:34 3:45:46 3:49:15 3:49:43 3:49:50 3:10:38 3:54:39 3:17:04 4:04:35 2:45:38 3:28:46 3:29:11 2:52:59 4:13:46 3:34:42 3:37:01 4:17:17 3:38:25 4:18:38 4:19:20 3:39:22 0:00:00 0:00:00 0:00:00 0:00:00 0:00:00 0:00:00 0:00:00 0:00:00 0:40:00 0:00:00 0:00:00 0:00:00 0:00:00 0:00:00 0:00:00 0:40:00 0:00:00 0:40:00 0:00:00 1:20:00 0:40:00 0:40:00 1:20:00 0:00:00 0:40:00 0:40:00 0:00:00 0:40:00 0:00:00 0:00:00 0:40:00 3:30:15 3:31:25 3:32:03 3:32:20 3:33:58 3:36:25 3:38:33 3:39:00 3:43:13 3:44:27 3:45:34 3:45:46 3:49:15 3:49:43 3:49:50 3:50:38 3:54:39 3:57:04 4:04:35 4:05:38 4:08:46 4:09:11 4:12:59 4:13:46 4:14:42 4:17:01 4:17:17 4:18:25 4:18:38 4:19:20 4:19:22 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55")
(def raw-data6-page3-t
"Унесихин Перевозчиков Кварацхелия Семенов Тиунов Чикин Дмитрий Стаценков Мостовой Прошакин Казанцев Скоров Юзеев Поленков Ярославцев Попов Максимов Тясин Захаров Куцепендик Сарваритдинов Белых Киселёв Мокиенко Поздеев Ванчинов Тихонов Чирков Обожин Галюк Чурин Михаил Александр Данил Николай Матвей Антон Никитин Виталий Алексей Денис Кирилл Денис Илья Олег Евгений Михаил Тимофей Владимир Алексей Андрей Амир Александр Владимир Дмитрий Артур Анатолий Иван Иван Николай Антон Евгений Екатеринбург Екатеринбург Екатеринбург Екатеринбург Сатка Екатеринбург Пермь Екатеринбург Миасс Тюмень Камышлов Магнитогорск Миасс Магнитогорск Пермь Каменск-Уральский Екатеринбург Екатеринбург Екатеринбург - Кыштым Первоуральск Челябинск Челябинск Магнитогорск Екатеринбург Екатеринбург Камышлов Екатеринбург Тюмень Екатеринбург 204 245 132 222 214 186 160 152 170 205 231 233 217 146 112 225 150 259 107 926 202 134 182 138 117 119 137 173 153 255 265 12:04:30 12:15:00 11:46:30 12:09:00 12:07:00 12:00:00 11:53:30 11:51:30 11:56:00 12:05:00 12:11:30 12:12:00 12:08:00 11:50:00 11:41:30 12:10:00 11:51:00 12:18:30 11:40:30 13:13:00 12:04:00 11:47:00 11:59:00 11:48:00 11:43:00 11:43:30 11:48:00 11:57:00 11:52:00 12:17:30 12:20:00 15:45:16 16:10:25 15:45:18 16:47:55 16:09:03 16:43:44 15:20:26 15:59:07 16:45:38 16:56:31 15:03:15 17:05:38 17:07:03 16:50:49 16:02:47 17:13:13 16:15:18 15:24:19 16:07:54 17:02:32 17:14:27 15:38:42 15:50:54 15:44:18 17:02:34 16:25:57 16:41:33 17:31:06 16:46:39 15:52:47 17:16:51 3:40:46 3:55:25 3:58:48 4:38:55 4:02:03 4:43:44 3:26:56 4:07:37 4:49:38 4:51:31 2:51:45 4:53:38 4:59:03 5:00:49 4:21:17 5:03:13 4:24:18 3:05:49 4:27:24 3:49:32 5:10:27 3:51:42 3:51:54 3:56:18 5:19:34 4:42:27 4:53:33 5:34:06 4:54:39 3:35:17 4:56:51 0:40:00 0:40:00 0:40:00 0:00:00 0:40:00 0:00:00 1:20:00 0:40:00 0:00:00 0:00:00 2:00:00 0:00:00 0:00:00 0:00:00 0:40:00 0:00:00 0:40:00 2:00:00 0:40:00 1:20:00 0:00:00 1:20:00 1:20:00 1:20:00 0:00:00 0:40:00 0:40:00 0:00:00 0:40:00 2:00:00 0:40:00 4:20:46 4:35:25 4:38:48 4:38:55 4:42:03 4:43:44 4:46:56 4:47:37 4:49:38 4:51:31 4:51:45 4:53:38 4:59:03 5:00:49 5:01:17 5:03:13 5:04:18 5:05:49 5:07:24 5:09:32 5:10:27 5:11:42 5:11:54 5:16:18 5:19:34 5:22:27 5:33:33 5:34:06 5:34:39 5:35:17 5:36:51 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86")
(def raw-data6-page4-t
"Николаев Залесов Вакушин Тарасов Баранов Фролов Адам Мугулов Мальков Теплоухов Ситников Култышев Мерзляков Зеленских Гусев Савонин Егоров Осколков Сафин Рысин Долженко Иванов Кокшаров Колягин Мезенцев Денисюк Томилов Бирюков Злобин Хакимов Хицов Владимир Алексей Сергей Станислав Никита Данила Иван Александр Игорь Игорь Игорь Владислав Александр Станислав Владимир Александр Кирилл Александр Руслан Юрий Дмитрий Владимир Ален Иван Вадим Денис Семён Денис Алексей Рамиль Юрий Тюмень Екатеринбург Миасс Тюмень Челябинск Тюмень Тюмень Ирбит Челябинск Пермь Ижевск Екатеринбург Пермь Челябинск Курган Магнитогорск Нижний-Тагил Тюмень Учалы - Тюмень Копейск Екатеринбург - Миасс Екатеринбург - Пермь - Уфа Челябинск 180 166 126 229 143 226 223 108 158 196 144 258 177 239 183 240 261 191 159 923 521 209 193 906 235 190 948 106 913 109 111 11:58:30 11:55:00 11:45:00 12:11:00 11:49:30 12:10:00 12:09:30 11:40:30 11:53:00 12:02:30 11:49:30 12:18:00 11:58:00 12:13:30 11:59:30 12:13:30 12:19:00 12:01:30 11:53:30 13:12:30 12:43:00 12:06:00 12:02:00 13:11:30 12:12:30 12:01:00 13:18:30 11:40:00 13:11:00 11:41:00 11:41:30 15:07:12 16:24:10 16:58:06 16:44:50 16:24:06 17:36:39 16:58:03 15:51:04 16:43:50 16:27:15 15:30:28 14:09:04 13:50:22 17:40:26 17:26:55 14:26:00 14:34:10 16:21:04 14:13:57 15:33:41 17:50:52 14:44:00 14:43:47 17:56:37 14:57:54 14:46:34 16:08:33 14:37:52 16:15:35 14:48:51 14:50:04 3:08:42 4:29:10 5:13:06 4:33:50 4:34:36 5:26:39 4:48:33 4:10:34 4:50:50 4:24:45 3:40:58 1:51:04 1:52:22 5:26:56 5:27:25 2:12:30 2:15:10 4:19:34 2:20:27 2:21:11 5:07:52 2:38:00 2:41:47 4:45:07 2:45:24 2:45:34 2:50:03 2:57:52 3:04:35 3:07:51 3:08:34 2:40:00 1:20:00 0:40:00 1:20:00 1:20:00 0:40:00 1:20:00 2:00:00 1:20:00 2:00:00 3:20:00 5:20:00 5:20:00 2:00:00 2:00:00 5:20:00 5:20:00 3:20:00 5:20:00 5:20:00 2:40:00 5:20:00 5:20:00 3:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:48:42 5:49:10 5:53:06 5:53:50 5:54:36 6:06:39 6:08:33 6:10:34 6:10:50 6:24:45 7:00:58 7:11:04 7:12:22 7:26:56 7:27:25 7:32:30 7:35:10 7:39:34 7:40:27 7:41:11 7:47:52 7:58:00 8:01:47 8:05:07 8:05:24 8:05:34 8:10:03 8:17:52 8:24:35 8:27:51 8:28:34 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117")
(def raw-data6-page5-t
"Прыкин Максимов Уфимцев Баранов Верещагин Кукурузов Хабибрахманов Калашников Богатырёв Жмаков Владимир Чикишев Тарасов Сухарев Каширин Нигматуллин Шаяхметов Салыев Зубков Береговой Беспалов Камалов Килин Ершов Савочкин Петр Филимончук Байдала Шестаков Беличев Нелюбин Дмитрий Сергей Сергей Сергей Андрей Иван Дамир Алексей Сергей Александр Мыкалов Александр Станислав Олег Евгений Ильшат Виталий Руслан Станислав Данил Александр Егор Максим Андрей Николай Худорожков Владимир Павел Евгений Сергей Сергей - Верхняя-Салда Челябинск Нягань Екатеринбург Екатеринбург Екатеринбург Магнитогорск - Учалы Челябинск Березовский Тюмень Екатеринбург Челябинск Учалы Аргаяш Челябинск Челябинск Миасс Челябинск Златоуст Березовский Екатеринбург Челябинск Екатеринбург Тюмень Екатеринбург Нягань Тюмень Тюмень 942 176 156 172 206 243 149 244 940 133 122 125 229 221 216 201 189 181 127 179 151 161 101 210 194 162 110 175 250 168 157 13:18:00 11:57:30 11:52:30 11:56:30 12:05:00 12:14:30 11:51:00 12:14:30 13:13:00 11:47:00 11:44:00 11:45:00 12:11:00 12:09:00 12:07:30 12:04:00 12:01:00 11:59:00 11:45:30 11:58:30 11:51:30 11:54:00 11:39:00 12:06:00 12:02:00 11:54:00 11:41:00 11:57:30 12:16:00 11:55:30 11:53:00 16:28:56 18:29:26 17:06:56 15:19:38 15:30:00 15:42:10 15:20:00 15:45:09 16:47:19 15:25:10 15:25:15 15:29:03 15:58:14 16:01:18 16:07:57 16:04:53 16:03:04 16:02:53 15:52:39 16:10:28 16:07:02 16:14:35 16:05:07 16:35:59 16:40:21 16:38:34 16:33:10 16:52:34 17:35:29 17:26:24 17:25:19 3:10:56 6:31:56 5:14:26 3:23:08 3:25:00 3:27:40 3:29:00 3:30:39 3:34:19 3:38:10 3:41:15 3:44:03 3:47:14 3:52:18 4:00:27 4:00:53 4:02:04 4:03:53 4:07:09 4:11:58 4:15:32 4:20:35 4:26:07 4:29:59 4:38:21 4:44:34 4:52:10 4:55:04 5:19:29 5:30:54 5:32:19 5:20:00 2:00:00 3:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 5:20:00 8:30:56 8:31:56 8:34:26 8:43:08 8:45:00 8:47:40 8:49:00 8:50:39 8:54:19 8:58:10 9:01:15 9:04:03 9:07:14 9:12:18 9:20:27 9:20:53 9:22:04 9:23:53 9:27:09 9:31:58 9:35:32 9:40:35 9:46:07 9:49:59 9:58:21 10:04:34 10:12:10 10:15:04 10:39:29 10:50:54 10:52:19 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148")

;; Эта страница снова нормальная в PDF
(def raw-data6-page6
"Шматков Дмитрий Челябинск 238 12:13:00 17:54:07 5:41:07 5:20:00 11:01:07 149
Душин Артём Ижевск 262 12:19:00 18:08:32 5:49:32 5:20:00 11:09:32 150
Кабаненко Максим Заречный 171 11:56:30 17:56:32 6:00:02 5:20:00 11:20:02 151
Попов Иван Екатеринбург 199 12:03:30 13:26:51 1:23:21 10:00:00 11:23:21 152
Антонов Максим Тюмень 333 12:30:00 17:00:00 4:30:00 10:00:00 14:30:00 153")

;; Разворачивает страницу чтобы она была человеческой
(defn transpose-back [raw-data rows]
  (let [parts (partition-all rows (str/split raw-data #"\s"))
        transposed (apply interleave parts)]
    (str/join "\n"
              (map #(str/join " " %) (partition-all 10 transposed)))))

(comment
  ;; 31 результат на этой странице
  (transpose-back raw-data6-page2-t 31)
  (transpose-back raw-data6-page3-t 31)
  (transpose-back raw-data6-page4-t 31)
  (transpose-back raw-data6-page5-t 31))

(def raw-data6-page2
"Ахманаев Дмитрий Екатеринбург 140 11:48:30 15:18:45 3:30:15 0:00:00 3:30:15 25
Некрасов Александр Копейск 154 11:52:00 15:23:25 3:31:25 0:00:00 3:31:25 26
Жилин Михаил Курган 203 12:04:30 15:36:33 3:32:03 0:00:00 3:32:03 27
Данилов Евгений Пермь 252 12:16:30 15:48:50 3:32:20 0:00:00 3:32:20 28
Толкачев Антон Талица 131 11:46:30 15:20:28 3:33:58 0:00:00 3:33:58 29
Козлов Денис Челябинск 129 11:46:00 15:22:25 3:36:25 0:00:00 3:36:25 30
Калинин Виктор Магнитогорск 128 11:45:30 15:24:03 3:38:33 0:00:00 3:38:33 31
Чибаков Влад - 934 13:13:00 16:52:00 3:39:00 0:00:00 3:39:00 32
Лугаськов Вадим Ревда 251 12:16:30 15:19:43 3:03:13 0:40:00 3:43:13 33
Вязин Владимир Курган 207 12:05:30 15:49:57 3:44:27 0:00:00 3:44:27 34
Шигабеев Евгений Заречный 120 11:43:30 15:29:04 3:45:34 0:00:00 3:45:34 35
Ахтямов Вадим Миасс 219 12:08:30 15:54:16 3:45:46 0:00:00 3:45:46 36
Бороздин Юрий Екатеринбург 169 11:56:00 15:45:15 3:49:15 0:00:00 3:49:15 37
Склюев Андрей Тюмень 184 11:59:30 15:49:13 3:49:43 0:00:00 3:49:43 38
Филиппов Иван Екатеринбург 246 12:15:00 16:04:50 3:49:50 0:00:00 3:49:50 39
Лепаев Алексей Уфа 236 12:12:30 15:23:08 3:10:38 0:40:00 3:50:38 40
Азаров Кирилл Челябинск 174 11:57:00 15:51:39 3:54:39 0:00:00 3:54:39 41
Зырянов Антон Магнитогорск 118 11:43:00 15:00:04 3:17:04 0:40:00 3:57:04 42
Носков Владимир Магнитогорск 215 12:07:30 16:12:05 4:04:35 0:00:00 4:04:35 43
Свяжин Артем - 920 13:12:30 15:58:08 2:45:38 1:20:00 4:05:38 44
Иванов Дмитрий Каменск-Уральский 105 11:40:00 15:08:46 3:28:46 0:40:00 4:08:46 45
Маркелов Константин Челябинск 237 12:13:00 15:42:11 3:29:11 0:40:00 4:09:11 46
Галкин Кирилл - 911 13:11:00 16:03:59 2:52:59 1:20:00 4:12:59 47
Фурсов Михаил Челябинск 218 12:08:00 16:21:46 4:13:46 0:00:00 4:13:46 48
Шаталин Андрей Челябинск 136 11:47:30 15:22:12 3:34:42 0:40:00 4:14:42 49
Попов Виктор Курган 130 11:46:00 15:23:01 3:37:01 0:40:00 4:17:01 50
Шафигулин Андрей Челябинск 178 11:58:00 16:15:17 4:17:17 0:00:00 4:17:17 51
Пашнин Владислав Миасское 135 11:47:30 15:25:55 3:38:25 0:40:00 4:18:25 52
Сборошенко Федор Челябинск 234 12:12:00 16:30:38 4:18:38 0:00:00 4:18:38 53
Белькевич Евгений Челябинск 121 11:44:00 16:03:20 4:19:20 0:00:00 4:19:20 54
Гуляев Алексей - 915 13:12:00 16:51:22 3:39:22 0:40:00 4:19:22 55")

(def raw-data6-page3
"Унесихин Михаил Екатеринбург 204 12:04:30 15:45:16 3:40:46 0:40:00 4:20:46 56
Перевозчиков Александр Екатеринбург 245 12:15:00 16:10:25 3:55:25 0:40:00 4:35:25 57
Кварацхелия Данил Екатеринбург 132 11:46:30 15:45:18 3:58:48 0:40:00 4:38:48 58
Семенов Николай Екатеринбург 222 12:09:00 16:47:55 4:38:55 0:00:00 4:38:55 59
Тиунов Матвей Сатка 214 12:07:00 16:09:03 4:02:03 0:40:00 4:42:03 60
Чикин Антон Екатеринбург 186 12:00:00 16:43:44 4:43:44 0:00:00 4:43:44 61
Дмитрий Никитин Пермь 160 11:53:30 15:20:26 3:26:56 1:20:00 4:46:56 62
Стаценков Виталий Екатеринбург 152 11:51:30 15:59:07 4:07:37 0:40:00 4:47:37 63
Мостовой Алексей Миасс 170 11:56:00 16:45:38 4:49:38 0:00:00 4:49:38 64
Прошакин Денис Тюмень 205 12:05:00 16:56:31 4:51:31 0:00:00 4:51:31 65
Казанцев Кирилл Камышлов 231 12:11:30 15:03:15 2:51:45 2:00:00 4:51:45 66
Скоров Денис Магнитогорск 233 12:12:00 17:05:38 4:53:38 0:00:00 4:53:38 67
Юзеев Илья Миасс 217 12:08:00 17:07:03 4:59:03 0:00:00 4:59:03 68
Поленков Олег Магнитогорск 146 11:50:00 16:50:49 5:00:49 0:00:00 5:00:49 69
Ярославцев Евгений Пермь 112 11:41:30 16:02:47 4:21:17 0:40:00 5:01:17 70
Попов Михаил Каменск-Уральский 225 12:10:00 17:13:13 5:03:13 0:00:00 5:03:13 71
Максимов Тимофей Екатеринбург 150 11:51:00 16:15:18 4:24:18 0:40:00 5:04:18 72
Тясин Владимир Екатеринбург 259 12:18:30 15:24:19 3:05:49 2:00:00 5:05:49 73
Захаров Алексей Екатеринбург 107 11:40:30 16:07:54 4:27:24 0:40:00 5:07:24 74
Куцепендик Андрей - 926 13:13:00 17:02:32 3:49:32 1:20:00 5:09:32 75
Сарваритдинов Амир Кыштым 202 12:04:00 17:14:27 5:10:27 0:00:00 5:10:27 76
Белых Александр Первоуральск 134 11:47:00 15:38:42 3:51:42 1:20:00 5:11:42 77
Киселёв Владимир Челябинск 182 11:59:00 15:50:54 3:51:54 1:20:00 5:11:54 78
Мокиенко Дмитрий Челябинск 138 11:48:00 15:44:18 3:56:18 1:20:00 5:16:18 79
Поздеев Артур Магнитогорск 117 11:43:00 17:02:34 5:19:34 0:00:00 5:19:34 80
Ванчинов Анатолий Екатеринбург 119 11:43:30 16:25:57 4:42:27 0:40:00 5:22:27 81
Тихонов Иван Екатеринбург 137 11:48:00 16:41:33 4:53:33 0:40:00 5:33:33 82
Чирков Иван Камышлов 173 11:57:00 17:31:06 5:34:06 0:00:00 5:34:06 83
Обожин Николай Екатеринбург 153 11:52:00 16:46:39 4:54:39 0:40:00 5:34:39 84
Галюк Антон Тюмень 255 12:17:30 15:52:47 3:35:17 2:00:00 5:35:17 85
Чурин Евгений Екатеринбург 265 12:20:00 17:16:51 4:56:51 0:40:00 5:36:51 86")

(def raw-data6-page4
"Николаев Владимир Тюмень 180 11:58:30 15:07:12 3:08:42 2:40:00 5:48:42 87
Залесов Алексей Екатеринбург 166 11:55:00 16:24:10 4:29:10 1:20:00 5:49:10 88
Вакушин Сергей Миасс 126 11:45:00 16:58:06 5:13:06 0:40:00 5:53:06 89
Тарасов Станислав Тюмень 229 12:11:00 16:44:50 4:33:50 1:20:00 5:53:50 90
Баранов Никита Челябинск 143 11:49:30 16:24:06 4:34:36 1:20:00 5:54:36 91
Фролов Данила Тюмень 226 12:10:00 17:36:39 5:26:39 0:40:00 6:06:39 92
Адам Иван Тюмень 223 12:09:30 16:58:03 4:48:33 1:20:00 6:08:33 93
Мугулов Александр Ирбит 108 11:40:30 15:51:04 4:10:34 2:00:00 6:10:34 94
Мальков Игорь Челябинск 158 11:53:00 16:43:50 4:50:50 1:20:00 6:10:50 95
Теплоухов Игорь Пермь 196 12:02:30 16:27:15 4:24:45 2:00:00 6:24:45 96
Ситников Игорь Ижевск 144 11:49:30 15:30:28 3:40:58 3:20:00 7:00:58 97
Култышев Владислав Екатеринбург 258 12:18:00 14:09:04 1:51:04 5:20:00 7:11:04 98
Мерзляков Александр Пермь 177 11:58:00 13:50:22 1:52:22 5:20:00 7:12:22 99
Зеленских Станислав Челябинск 239 12:13:30 17:40:26 5:26:56 2:00:00 7:26:56 100
Гусев Владимир Курган 183 11:59:30 17:26:55 5:27:25 2:00:00 7:27:25 101
Савонин Александр Магнитогорск 240 12:13:30 14:26:00 2:12:30 5:20:00 7:32:30 102
Егоров Кирилл Нижний-Тагил 261 12:19:00 14:34:10 2:15:10 5:20:00 7:35:10 103
Осколков Александр Тюмень 191 12:01:30 16:21:04 4:19:34 3:20:00 7:39:34 104
Сафин Руслан Учалы 159 11:53:30 14:13:57 2:20:27 5:20:00 7:40:27 105
Рысин Юрий - 923 13:12:30 15:33:41 2:21:11 5:20:00 7:41:11 106
Долженко Дмитрий Тюмень 521 12:43:00 17:50:52 5:07:52 2:40:00 7:47:52 107
Иванов Владимир Копейск 209 12:06:00 14:44:00 2:38:00 5:20:00 7:58:00 108
Кокшаров Ален Екатеринбург 193 12:02:00 14:43:47 2:41:47 5:20:00 8:01:47 109
Колягин Иван - 906 13:11:30 17:56:37 4:45:07 3:20:00 8:05:07 110
Мезенцев Вадим Миасс 235 12:12:30 14:57:54 2:45:24 5:20:00 8:05:24 111
Денисюк Денис Екатеринбург 190 12:01:00 14:46:34 2:45:34 5:20:00 8:05:34 112
Томилов Семён - 948 13:18:30 16:08:33 2:50:03 5:20:00 8:10:03 113
Бирюков Денис Пермь 106 11:40:00 14:37:52 2:57:52 5:20:00 8:17:52 114
Злобин Алексей - 913 13:11:00 16:15:35 3:04:35 5:20:00 8:24:35 115
Хакимов Рамиль Уфа 109 11:41:00 14:48:51 3:07:51 5:20:00 8:27:51 116
Хицов Юрий Челябинск 111 11:41:30 14:50:04 3:08:34 5:20:00 8:28:34 117")

(def raw-data6-page5
"Прыкин Дмитрий - 942 13:18:00 16:28:56 3:10:56 5:20:00 8:30:56 118
Максимов Сергей Верхняя-Салда 176 11:57:30 18:29:26 6:31:56 2:00:00 8:31:56 119
Уфимцев Сергей Челябинск 156 11:52:30 17:06:56 5:14:26 3:20:00 8:34:26 120
Баранов Сергей Нягань 172 11:56:30 15:19:38 3:23:08 5:20:00 8:43:08 121
Верещагин Андрей Екатеринбург 206 12:05:00 15:30:00 3:25:00 5:20:00 8:45:00 122
Кукурузов Иван Екатеринбург 243 12:14:30 15:42:10 3:27:40 5:20:00 8:47:40 123
Хабибрахманов Дамир Екатеринбург 149 11:51:00 15:20:00 3:29:00 5:20:00 8:49:00 124
Калашников Алексей Магнитогорск 244 12:14:30 15:45:09 3:30:39 5:20:00 8:50:39 125
Богатырёв Сергей - 940 13:13:00 16:47:19 3:34:19 5:20:00 8:54:19 126
Жмаков Александр Учалы 133 11:47:00 15:25:10 3:38:10 5:20:00 8:58:10 127
Владимир Мыкалов Челябинск 122 11:44:00 15:25:15 3:41:15 5:20:00 9:01:15 128
Чикишев Александр Березовский 125 11:45:00 15:29:03 3:44:03 5:20:00 9:04:03 129
Тарасов Станислав Тюмень 229 12:11:00 15:58:14 3:47:14 5:20:00 9:07:14 130
Сухарев Олег Екатеринбург 221 12:09:00 16:01:18 3:52:18 5:20:00 9:12:18 131
Каширин Евгений Челябинск 216 12:07:30 16:07:57 4:00:27 5:20:00 9:20:27 132
Нигматуллин Ильшат Учалы 201 12:04:00 16:04:53 4:00:53 5:20:00 9:20:53 133
Шаяхметов Виталий Аргаяш 189 12:01:00 16:03:04 4:02:04 5:20:00 9:22:04 134
Салыев Руслан Челябинск 181 11:59:00 16:02:53 4:03:53 5:20:00 9:23:53 135
Зубков Станислав Челябинск 127 11:45:30 15:52:39 4:07:09 5:20:00 9:27:09 136
Береговой Данил Миасс 179 11:58:30 16:10:28 4:11:58 5:20:00 9:31:58 137
Беспалов Александр Челябинск 151 11:51:30 16:07:02 4:15:32 5:20:00 9:35:32 138
Камалов Егор Златоуст 161 11:54:00 16:14:35 4:20:35 5:20:00 9:40:35 139
Килин Максим Березовский 101 11:39:00 16:05:07 4:26:07 5:20:00 9:46:07 140
Ершов Андрей Екатеринбург 210 12:06:00 16:35:59 4:29:59 5:20:00 9:49:59 141
Савочкин Николай Челябинск 194 12:02:00 16:40:21 4:38:21 5:20:00 9:58:21 142
Петр Худорожков Екатеринбург 162 11:54:00 16:38:34 4:44:34 5:20:00 10:04:34 143
Филимончук Владимир Тюмень 110 11:41:00 16:33:10 4:52:10 5:20:00 10:12:10 144
Байдала Павел Екатеринбург 175 11:57:30 16:52:34 4:55:04 5:20:00 10:15:04 145
Шестаков Евгений Нягань 250 12:16:00 17:35:29 5:19:29 5:20:00 10:39:29 146
Беличев Сергей Тюмень 168 11:55:30 17:26:24 5:30:54 5:20:00 10:50:54 147
Нелюбин Сергей Тюмень 157 11:53:00 17:25:19 5:32:19 5:20:00 10:52:19 148")

;; Станислав Тарасов у нас два раза в протоколе - на 90 и на 130 месте
;; Оставил только один результат - 90е место

(def raw-data5-page1
"Пономарчук Владимир Челябинск 320 12:26:30 15:43:56 3:17:26 0:00:00 3:17:26 1
Кузнецов Сергей Катайск 325 12:28:00 15:23:05 2:55:05 0:40:00 3:35:05 2
Полянин Александр Златоуст 311 12:24:30 15:24:30 3:00:00 0:40:00 3:40:00 3
Шабуров Виктор Екатеринбург 303 12:22:30 15:26:45 3:04:15 0:40:00 3:44:15 4
Стелюк Антон Тюмень 327 12:28:30 15:38:50 3:10:20 0:40:00 3:50:20 5
Дубровин Сергей Миасс 305 12:23:00 16:23:16 4:00:16 0:00:00 4:00:16 6
Тырыкин Антон Челябинск 317 12:26:00 16:30:41 4:04:41 0:00:00 4:04:41 7
Денисов Артем Трехгорный 329 12:29:00 16:01:33 3:32:33 0:40:00 4:12:33 8
Волков Андрей Каменск-Уральский 312 12:24:30 16:11:55 3:47:25 0:40:00 4:27:25 9
Саломатин Ярослав Златоуст 328 12:28:30 15:43:31 3:15:01 1:20:00 4:35:01 10
Холкин Дмитрий Екатеринбург 330 12:29:00 17:07:01 4:38:01 0:40:00 5:18:01 11
Зиязов Ростислав Пермь 332 12:29:30 16:27:48 3:58:18 1:20:00 5:18:18 12
Моисеев Евгений Челябинск 322 12:27:00 15:53:30 3:26:30 2:40:00 6:06:30 13
Похващев Андрей - 932 13:13:00 15:25:07 2:12:07 5:20:00 7:32:07 14
Кириллов Артём Уфа 302 12:22:00 15:00:46 2:38:46 5:20:00 7:58:46 15
Достовалов Евгений Курган 331 12:29:30 15:33:55 3:04:25 5:20:00 8:24:25 16
Заболоцкий Иван - 919 13:12:00 16:18:52 3:06:52 5:20:00 8:26:52 17
Тихонов Вадим Уфа 310 12:24:00 15:44:20 3:20:20 5:20:00 8:40:20 18
Хвостенко Олег Екатеринбург 307 12:23:30 15:43:54 3:20:24 5:20:00 8:40:24 19
Анисимов Александр Екатеринбург 306 12:23:00 16:13:24 3:50:24 5:20:00 9:10:24 20
Староватов Андрей Златоуст 304 12:22:30 16:21:31 3:59:01 5:20:00 9:19:01 21
Соболев Иван Каменск-Уральский 316 12:25:30 16:24:39 3:59:09 5:20:00 9:19:09 22
Копытов Олег Нягань 321 12:27:00 16:46:19 4:19:19 5:20:00 9:39:19 23
Мордюженко Эдуард Каменск-Уральский 309 12:24:00 16:50:50 4:26:50 5:20:00 9:46:50 24")

(def raw-data5-page2
"Орбан Александр Нижняя-Салда 308 12:23:30 18:02:47 5:39:17 5:20:00 10:59:17 25
Овчинников Антон Тюмень 314 12:25:00 14:20:00 1:55:00 10:00:00 11:55:00 26
Кокшаров Максим Пермь 324 12:27:30 15:51:40 3:24:10 10:00:00 13:24:10 27
Маликов Андрей Нягань 326 12:28:00 17:30:00 5:02:00 10:00:00 15:02:00 28")

(def raw-data4-page1
"Скулкин	Семён	-	921	13:13:00	16:24:56	03:11:56	00:00:00	03:11:56	1
Асташов	Леонид	Половинный	407	12:33:30	16:51:29	04:17:59	00:00:00	04:17:59	4
Стаин	Павел	Екатеринбург	404	12:32:30	15:41:14	03:08:44	01:20:00	04:28:44	2
Нохов	Ринат	Миасс	405	12:33:00	17:10:11	04:37:11	00:00:00	04:37:11	5
Мирзаметов	Евгений	-	922	13:13:00	17:14:42	04:01:42	00:40:00	04:41:42	3
Тараторин	Василий	Кременкуль	406	12:33:00	17:03:06	04:30:06	00:40:00	05:10:06	11
Талыгин	Александр	Мирный	412	12:34:30	16:34:46	04:00:16	01:20:00	05:20:16	15
Коноплев	Егор	Екатеринбург	415	12:35:30	17:42:15	05:06:45	02:00:00	07:06:45	6
Белоногов	Роман	Каменск-Уральский	411	12:34:30	15:44:31	03:10:01	05:20:00	08:30:01	12
Медведев	Виктор	Миасс	419	12:36:30	16:06:42	03:30:12	05:20:00	08:50:12	7
Пестов	Максим	Белорецк	402	12:32:00	16:12:09	03:40:09	05:20:00	09:00:09	8
Ефимов	илья	Каменск-Уральский	416	12:35:30	16:15:41	03:40:11	05:20:00	09:00:11	9
Ишонин	Александр	Озерск	418	12:36:00	16:19:24	03:43:24	05:20:00	09:03:24	10
Сажин	Дмитрий	Екатеринбург	408	12:33:30	16:38:38	04:05:08	05:20:00	09:25:08	16
Ужегов	Сергей	-	904	13:10:00	14:46:26	01:36:26	10:00:00	11:36:26	14
Зверев	Александр	Златоуст	413	12:35:00	14:59:12	02:24:12	10:00:00	12:24:12	13
Паршаков	Максим	Челябинск	417	12:36:00	17:04:31	04:28:31	10:00:00	14:28:31	17")

(def raw-data3-page1
"Новопашин	Александр	Тюмень	507	12:39:30	16:19:36	03:40:06	00:00:00	03:40:06	1
Бескровный	Александр	Челябинск	554	12:51:00	16:32:53	03:41:53	00:00:00	03:41:53	2
Борисов	Сергей	Челябинск	511	12:40:30	16:25:33	03:45:03	00:00:00	03:45:03	3
Тимошевский	Дмитрий	Коркино	548	12:49:30	16:45:52	03:56:22	00:00:00	03:56:22	4
Кабаев	Александр	Челябинск	539	12:47:30	16:06:27	03:18:57	00:40:00	03:58:57	5
Слабочков	Алексей	Миасс	528	12:44:30	16:48:21	04:03:51	00:00:00	04:03:51	6
Дудников	Василий	-	938	13:19:00	17:30:16	04:11:16	00:00:00	04:11:16	7
Исупов	Евгений	Пермь	541	12:48:00	16:09:37	03:21:37	01:20:00	04:41:37	8
Варгасов	Валера	Челябинск	517	12:42:00	16:05:37	03:23:37	01:20:00	04:43:37	9
Котельников	Артём	Челябинск	502	12:38:00	16:07:17	03:29:17	01:20:00	04:49:17	10
Фадеев	Алексей	Миасс	542	12:48:00	16:23:06	03:35:06	01:20:00	04:55:06	11
Тынкасов	Константин	Златоуст	534	12:46:00	16:26:35	03:40:35	01:20:00	05:00:35	12
Хонькин	Владислав	Еманжелинск	537	12:47:00	16:30:55	03:43:55	01:20:00	05:03:55	13
Аристахов	Антон	-	925	13:13:00	17:01:30	03:48:30	01:20:00	05:08:30	14
Воробьев	Денис	Челябинск	547	12:49:30	16:38:56	03:49:26	01:20:00	05:09:26	15
Исаев	Александр	Южноуральск	552	12:50:30	16:55:58	04:05:28	01:20:00	05:25:28	16
Жук	Василий	Еманжелинск	510	12:40:00	16:47:53	04:07:53	01:20:00	05:27:53	17
Анисимов	Сергей	Пермь	501	12:38:00	16:51:15	04:13:15	01:20:00	05:33:15	18
Василькин	Евгений	Тобольск	513	12:41:00	17:00:40	04:19:40	01:20:00	05:39:40	19
Прядко	Дмитрий	-	941	13:13:00	13:45:40	00:32:40	05:20:00	05:52:40	20
Полыгалов	Алексей	-	949	12:52:30	17:38:40	04:46:10	01:20:00	06:06:10	21
Ищук	Алексей	Екатеринбург	505	12:39:00	13:43:00	01:04:00	05:20:00	06:24:00	22
Сумин	Александр	Челябинск	516	12:41:30	16:54:11	04:12:41	02:40:00	06:52:41	23
Тимошевский	Максим	Челябинск	545	12:49:00	14:22:46	01:33:46	05:20:00	06:53:46	24")

(def raw-data3-page2
"Мочалов	Владислав	Миасс	531	12:45:30	14:37:34	01:52:04	05:20:00	07:12:04	25
Храмов	Александр	Ревда	509	12:40:00	14:53:34	02:13:34	05:20:00	07:33:34	26
Кармацких	Василий	Тюмень	557	12:52:00	15:08:33	02:16:33	05:20:00	07:36:33	27
Созыкин	Андрей	Копейск	503	12:38:30	15:07:55	02:29:25	05:20:00	07:49:25	28
Самойлов	Алексей	Копейск	540	12:47:30	15:17:50	02:30:20	05:20:00	07:50:20	29
Лазукин	Сергей	Снежинск	556	12:51:30	15:23:59	02:32:29	05:20:00	07:52:29	30
Ахмадиев	Роман	Копейск	525	12:44:00	15:22:30	02:38:30	05:20:00	07:58:30	31
Михалев	Александр	Екатеринбург	538	12:47:00	15:29:00	02:42:00	05:20:00	08:02:00	32
Симаков	Евгений	-	929	13:13:00	16:00:20	02:47:20	05:20:00	08:07:20	33
Курчев	Александр	Пермь	518	12:42:00	15:34:43	02:52:43	05:20:00	08:12:43	34
Евдокимов	Станислав	Курган	543	12:48:30	15:44:39	02:56:09	05:20:00	08:16:09	35
Жданов	Владимир	-	918	13:12:30	16:15:16	03:02:46	05:20:00	08:22:46	36
Деревенченко	Денис	-	909	13:10:30	16:19:04	03:08:34	05:20:00	08:28:34	37
Матвеев	Алексей	Верхняя-Пышма	512	12:40:30	15:50:40	03:10:10	05:20:00	08:30:10	38
Кийко	Антон	Екатеринбург	536	12:46:30	15:59:01	03:12:31	05:20:00	08:32:31	39
Максимов	Евгений	Челябинск	526	12:44:00	16:03:40	03:19:40	05:20:00	08:39:40	40
Салмин	Вячеслав	Миасс	546	12:49:00	16:09:32	03:20:32	05:20:00	08:40:32	41
Одиноков	Константин	Златоуст	520	12:42:30	16:19:06	03:36:36	05:20:00	08:56:36	42
Лобко	Юрий	Челябинск	515	12:41:30	16:21:40	03:40:10	05:20:00	09:00:10	43
Потлов	Сергей	Златоуст	550	12:50:00	16:34:31	03:44:31	05:20:00	09:04:31	44
Мохнин	Никита	Тюмень	555	12:51:30	16:54:09	04:02:39	05:20:00	09:22:39	45
Мохнин	Иван	Тюмень	535	12:46:30	16:54:18	04:07:48	05:20:00	09:27:48	46
Сазанов	Алексей	Тюмень	524	12:43:30	17:15:02	04:31:32	05:20:00	09:51:32	47
Дегтярёв	Михаил	-	945	13:13:30	17:58:04	04:44:34	05:20:00	10:04:34	48
Дегтярёв	Андрей	-	946	13:13:30	17:58:05	04:44:35	05:20:00	10:04:35	49
Моисеев	Иван	Челябинск	529	12:45:00	17:31:28	04:46:28	05:20:00	10:06:28	50
Розенбаум	Константин	Екатеринбург	508	12:39:30	17:37:02	04:57:32	05:20:00	10:17:32	51
Чирков	Дмитрий	Екатеринбург	504	12:38:30	13:26:51	00:48:21	10:00:00	10:48:21	52
Исупов	Евгений	Пермь	541	12:48:00	14:31:57	01:43:57	10:00:00	11:43:57	53
Уткин	Сергей	Тюмень	527	12:44:30	15:12:53	02:28:23	10:00:00	12:28:23	54
Орешко	Александр	Копейск	532	12:45:30	15:58:00	03:12:30	10:00:00	13:12:30	55")

(def raw-data3-page3
"Ягудин	Сергей	Рощино	544	12:48:30	16:09:23	03:20:53	10:00:00	13:20:53	56")

(def raw-data2-page1
"Шабловская	Дарья	Екатеринбург	606	12:55:00	15:49:58	02:54:58	00:00:00	02:54:58	1
Потапович	Ксения	Екатеринбург	604	12:54:30	15:50:25	02:55:55	00:40:00	03:35:55	2
Медведева	Анна	Челябинск	602	12:54:00	16:57:22	04:03:22	00:00:00	04:03:22	3
Аверина	Марина	Екатеринбург	605	12:55:00	17:20:20	04:25:20	00:00:00	04:25:20	4
Храмцова	Ульяна	Златоуст	603	12:54:30	15:26:09	02:31:39	02:00:00	04:31:39	5
Юлия	Березинских	Тюмень	607	12:55:30	15:39:14	02:43:44	02:00:00	04:43:44	6
Шилова	Анастасия	Златоуст	609	12:56:00	17:47:05	04:51:05	02:00:00	06:51:05	7
Гришина	Маргарита	Магнитогорск	601	12:54:00	17:32:09	04:38:09	06:00:00	10:38:09	8
Евграфова	Анна	Москва	610	12:56:00	13:54:30	00:58:30	06:00:00	06:58:30	9
Макеева	Наталья	-	937	13:13:00	14:16:34	01:03:34	06:00:00	07:03:34	10")


(defn parse-raw-data1 [raw-data]
  (for [line (str/split raw-data #"\n")
        :when (not (str/blank? line))]
    (let [[surname name city number start end total penalty total2 position] (str/split line #"\s")]
      {:type     :rider-info
         :name     name
         :surname  surname
         :city     city
         :rider-id (rider-id)

       ;:number number
       ;:position position

       }

      ;; Вспомогательная функция
      ;; Мы хотим чтобы данные были человекочитаемые, поэтому выводим не результат, а форму
      ;; Вектор тоже для читаемости, мапа будет в случайном порядке
      (let [pos (Integer/parseInt position)]
        (prn
          `[:type :result
            :event-id "EALkbw"
            :classification-id "CbnNqePYIllI"
            :position ~pos
            :plate-number ~number
            :rider-id (find-rider-id ~name ~surname)
            :start ~start :finish ~end :penalty ~penalty :total ~total2])))))

(comment
  (parse-raw-data1 raw-data7)

  (parse-raw-data1 raw-data6-page1)
  (parse-raw-data1 raw-data6-page2)
  (parse-raw-data1 raw-data6-page3)
  (parse-raw-data1 raw-data6-page4)
  (parse-raw-data1 raw-data6-page5)
  (parse-raw-data1 raw-data6-page6)

  (parse-raw-data1 raw-data5-page1)
  (parse-raw-data1 raw-data5-page2)

  )